---
kind: type
id: T:Autodesk.Revit.DB.ThermalMaterialType
source: html/73446ebc-6ebf-855c-aadc-a4d4291cc082.htm
---
# Autodesk.Revit.DB.ThermalMaterialType

Represents the thermal material type.

## Syntax (C#)
```csharp
public enum ThermalMaterialType
```